# Создаём функции что-бы было удобнее пользоватся, а не вводить по многу раз a-b или a+b
def fold(a, b): # Вход 2 параметра 1число и второе
    print(f'Результат сложения: ', end="") # Выводим текст результата
    return a + b # Возвращаем результат

def ssub(a, b):
    print(f'Результат вычитания: ', end="")
    return a - b
#  ====================================================================================
print("Программа-калькулятор \n Привет, что хочешь сделать? \n Доступные операции: \n Сложить '+'\n Вычесть '-'")

# Создаём цикл, бесконечный, "на самом деле я просто не знаю как в try-exept сделать так что бы он читал ошибку символов операций"
# Далее в цикле мы создаём переменную, и делаем сразу первый ввод операции + или -
# Если ошибка, то цикл начнётся всё снова, далее идёт проверка введённой операции, если + то складываем если - то отнимаем
# там тоже есть проверка на ошибку введённых данных, exit() завершает цикл, что бы он напрасно не повторялся

# Создаём бесконечный цикл
while True:
    # Создаём переменную для сравнения операции, сразу запихиваем туда ввод данного
    operation = input("Выберите операцию, введя символ '+' или '-': ")
    # создаём проверку путём сравнения
    if operation == '+':
        # повторно создаём бесконечный цикл, и проверку на исключение try-exept
        while True:
            # Если правильно введено число, то try, тут мы вызываем функцию fold и передаём в ней 2 аргумента, "числа"
            # И получаем результат, после чего программа закрывается exit()
            try:
                print(fold(int(input('Введите первое число: ')), int(input('Введите второе число: '))))
                exit()
            #     Если введена не цифра, то будет ошибка значения
            except ValueError:
                print(f'Ошибка, введите только цифры')
    # Сдесь точно также, сначала сравнение ==, потом цикл беск, дальше try-exept, и выход из программы если всё хорошо
    elif operation == '-':
        while True:
            try:
                print(ssub(int(input('Введите первое число: ')), int(input('Введите второе число: '))))
                exit()
            except ValueError:
                print(f'Ошибка, введите только цифры')
    # Ошибка, если ввел не + или -
    else:
        print('Вы ввели неверную операцию, повторите')
